# Dev Environment
brew "bash"                   # Modern Unix shell
brew "coreutils"              # GNU core utilities for macOS
brew "neovim"                 # Hyperextensible Vim-based text editor
brew "tmux"                   # Terminal multiplexer
brew "ripgrep"                # Fast recursive search tool (like grep)
brew "fd"                     # User-friendly alternative to find
brew "fzf"                    # Fuzzy finder for the terminal
brew "bat"                    # cat clone with syntax highlighting
brew "stylua"                 # Opinionated Lua code formatter
brew "tokei"                  # Count lines of code per language
brew "just"                   # Command runner for project tasks

# Languages
brew "python@3.12"            # Python 3.12 programming language
brew "python@3.13"            # Python 3.13 (pre-release or dev)
brew "pipx"                   # Run Python apps in isolated environments
brew "python-setuptools"     # Tools for building and distributing Python packages
brew "deno"                   # Secure runtime for JavaScript and TypeScript
brew "nvm"                    # Node.js version manager
brew "openjdk"               # Java Development Kit
brew "zig"                    # Low-level programming language

# Containers & DevOps
brew "colima"                 # Container runtime for Docker/Linux on macOS
brew "docker"                 # Container platform for building and running apps
brew "docker-compose"         # Define and run multi-container apps
brew "lazydocker"             # Terminal UI for managing Docker
brew "kubernetes-cli"         # kubectl — Kubernetes command-line tool
brew "minikube"               # Run a local Kubernetes cluster
brew "helm"                   # Kubernetes package manager
brew "terraform"              # Infrastructure as Code tool
brew "azure-cli"              # Microsoft Azure command-line interface

# Tools
brew "httpie"                 # User-friendly alternative to cURL
brew "htop"                   # Interactive process viewer
brew "jq"                     # Command-line JSON processor
brew "yadm"                   # Dotfiles manager using Git
