tap "caskroom/cask"
tap "coursier/formulas"
tap "felixkratz/formulae"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "nrwl/nx"
brew "python@3.13"
brew "azure-cli"
brew "bash"
brew "bat"
brew "colima"
brew "coreutils"
brew "delve"
brew "deno"
brew "docker"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "openjdk"
brew "gradle"
brew "helm"
brew "htop"
brew "httpie"
brew "jq"
brew "just"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "llvm"
brew "maven"
brew "minikube"
brew "neovim"
brew "nvm"
brew "openjdk@17"
brew "pipx"
brew "python-setuptools"
brew "python@3.10"
brew "python@3.12"
brew "redis"
brew "ripgrep"
brew "sqlc"
brew "stylua"
brew "terraform"
brew "tmux"
brew "tokei"
brew "zig"
brew "coursier/formulas/coursier"
cask "aerospace"
cask "calibre"
cask "firefox"
cask "ghostty"
cask "intellij-idea-ce"
cask "minecraft"
cask "obs"
cask "obsidian"
cask "raspberry-pi-imager"
cask "spotify"
cask "temurin@8"
cask "tunnelblick"
cask "unity-hub"
cask "utm"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
go "github.com/spf13/cobra-cli"
go "golang.org/x/tools/gopls"
